Scripts/Scalability/Tsung/VerifyTsungSetup/Test_Setup_1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1"/>
  </clients>
  
  <servers>
    <server host="neatostaging.rajatogo.com" port="80" type="tcp"></server>
  </servers>

  <load>
   <arrivalphase phase="1" duration="1" unit="minute">
     <users arrivalrate="10" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

   	<thinktime value="0.001" random="true"></thinktime>
  	<request> 
      <match do="dump" when="match">.</match>
  		<http url="http://neatostaging.rajatogo.com/api/rest/json/?method=site.get_api_version" method="POST" version="1.1" contents="api_key=1e26686d806d82144a71ea9a99d1b3169adaad917"></http>
  	</request>

  </session>
 </sessions>
</tsung>