Scripts/Scalability/Tsung/VerifyTsungSetup/Test_Setup_2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info" version="1.0">

	<clients>
		<client host="localhost" use_controller_vm="true" maxusers="10"></client>
	</clients>

	<servers>
		<server host="neatostaging.rajatogo.com" port="5222" type="tcp"></server>
	</servers>

	<load>
		<arrivalphase phase="1" duration="5" unit="minute">
			<users arrivalrate="100" unit="second"></users>
		</arrivalphase>
	</load>

	<options>
		<option type="ts_jabber" name="global_number" value="1"></option>
		<option type="ts_jabber" name="userid_max" value="1"></option>
		<option type="ts_jabber" name="domain" value="rajatogo"></option>
		<option type="ts_jabber" name="username" value="neato"></option>
		<option type="ts_jabber" name="passwd" value="neato"></option>
	</options>

	<sessions>
		<session probability="90" name="robot_online" type="ts_jabber">

			<request> <jabber type="connect" ack="local"></jabber> </request>

			<thinktime value="1"></thinktime>

			<transaction name="authenticate">
				<request>
					<jabber type="auth_sasl" ack="local"></jabber>
				</request>

				<request>
					<jabber type="connect" ack="local"></jabber>
				</request>

				<request>
					<jabber type="auth_sasl_bind" ack="local"></jabber>
				</request>
				<request>
					<jabber type="auth_sasl_session" ack="local"></jabber>
				</request>
			</transaction>

			<request>
					<jabber type="presence:initial" ack="no_ack" />
			</request>

			<thinktime value="1"></thinktime>

			<transaction name="online">
				<request>
					<jabber type="chat" ack="no_ack" size="16" destination="online"></jabber>
				</request>
			</transaction>

			<thinktime value="240"></thinktime>

  			<transaction name="offline">
				<request>
					<jabber type="chat" ack="no_ack" size="56" destination="offline"></jabber>
				</request>
			</transaction>
			<thinktime value="1"></thinktime>
			<transaction name="close">
				<request>
					<jabber type="close" ack="no_ack"></jabber>
				</request>
			</transaction>

		</session>

		<session name="http-example" probability="10" type="ts_http">

		   	<thinktime value="10"></thinktime>
		  	<request> 
		      <match do="dump" when="match">.</match>
		  		<http url="http://neatostaging.rajatogo.com/api/rest/json/?method=robot.get_robot_presence_status" method="POST" version="1.1" contents="api_key=1e26686d806d82144a71ea9a99d1b3169adaad917&amp;serial_number=neato1"></http>
		  	</request>

		</session>

	</sessions>

</tsung>